In [10]:
import pandas as pd
import re

In [2]:
ls = [['A',1],['B',2],['C',3],['D',4]]
df = pd.DataFrame(ls,columns = ['Key','Value'])
df

  Key  Value
0   A      1
1   B      2
2   C      3
3   D      4

In [6]:
Stu = {'Subject':['Maths','Science','English'],
      'Student 1':[89,77,86],
      'Student 2':[92,89,96],
      'Student 3':[65,72,45]
      }
df= pd.DataFrame(Stu,index = ['S1','S2','S3'])
df

    Subject  Student 1  Student 2  Student 3
S1    Maths         89         92         65
S2  Science         77         89         72
S3  English         86         96         45

In [7]:
df = pd.DataFrame({'City':['New York', 'Parague', 'New Delhi', 'Venice', 'new Orleans'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy', 'Tech_Summit'],
                    'Cost':[10000, 5000, 15000, 2000, 12000]})
index = [pd.Period('2-2018'), pd.Period('04-2018'),
          pd.Period('06-2018'), pd.Period('10-2018'), pd.Period('12-2018')]
df.index = index
df

                City        Event   Cost
2018-02     New York        Music  10000
2018-04      Parague       Poetry   5000
2018-06    New Delhi      Theatre  15000
2018-10       Venice       Comedy   2000
2018-12  new Orleans  Tech_Summit  12000

In [26]:
dfn = df.replace('[nN]ew','New_',regex = True)
dfn

                 City        Event   Cost
2018-02     New_ York        Music  10000
2018-04       Parague       Poetry   5000
2018-06    New_ Delhi      Theatre  15000
2018-10        Venice       Comedy   2000
2018-12  New_ Orleans  Tech_Summit  12000

In [28]:
i=0
for city in dfn.City:
    if re.search('New',city):
        dfn.City[i] = city+'(City)'
    i=i+1

<ipython-input-28-809a7bf32745>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfn.City[i] = city+'(City)'

In [30]:
dfn.City

2018-02       New_ York(City)
2018-04               Parague
2018-06      New_ Delhi(City)
2018-10                Venice
2018-12    New_ Orleans(City)
Freq: M, Name: City, dtype: object

In [32]:
def clean_names(city):
    if re.search(r'\(.*',city):
        pos = re.search(r'\(.*',city).start()
        return city[:pos]
    else:
        return city
dfn.City = dfn.City.apply(clean_names)
dfn

                 City        Event   Cost
2018-02     New_ York        Music  10000
2018-04       Parague       Poetry   5000
2018-06    New_ Delhi      Theatre  15000
2018-10        Venice       Comedy   2000
2018-12  New_ Orleans  Tech_Summit  12000

In [34]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':[' UMbreLla', '  maTress', 'BaDmintoN ', 'Shuttle'],
                   'Updated_Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 8, 15, 10]})

In [35]:
df

        Date     Product  Updated_Price  Discount
0  10/2/2011    UMbreLla           1250        10
1  11/2/2011     maTress           1450         8
2  12/2/2011  BaDmintoN            1550        15
3  13/2/2011     Shuttle            400        10

In [45]:
df.Product = df.Product.apply(lambda x:x.strip().capitalize())

In [46]:
df

        Date    Product  Updated_Price  Discount
0  10/2/2011   Umbrella           1250        10
1  11/2/2011    Matress           1450         8
2  12/2/2011  Badminton           1550        15
3  13/2/2011    Shuttle            400        10

In [48]:
initial_data = {'First_name': ['Ram', 'Mohan', 'Tina', 'Jeetu', 'Meera'], 
                'Last_name': ['Kumar', 'Sharma', 'Ali', 'Gandhi', 'Kumari'], 
                'Age': [42, 52, 36, 21, 23], 
                'City': ['Mumbai', 'Noida', 'Pune', 'Delhi', 'Bihar']}
df = pd.DataFrame(initial_data)
df

  First_name Last_name  Age    City
0        Ram     Kumar   42  Mumbai
1      Mohan    Sharma   52   Noida
2       Tina       Ali   36    Pune
3      Jeetu    Gandhi   21   Delhi
4      Meera    Kumari   23   Bihar

In [50]:
new = {0:'Shyam',
      2:'Ravi',
      3:'Shriya'}
df.First_name.update(pd.Series(new))

In [51]:
df

  First_name Last_name  Age    City
0      Shyam     Kumar   42  Mumbai
1      Mohan    Sharma   52   Noida
2       Ravi       Ali   36    Pune
3     Shriya    Gandhi   21   Delhi
4      Meera    Kumari   23   Bihar

In [52]:
df = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [54]:
dfn = df[0:10]

In [55]:
dfn.stack()

0  Name         Avery Bradley
   Team        Boston Celtics
   Number                   0
   Position                PG
   Age                     25
                    ...
9  Age                     22
   Height                 6-4
   Weight                 220
   College     Oklahoma State
   Salary         3.43104e+06
Length: 87, dtype: object

In [59]:
q = pd.melt(dfn,id_vars = ['Name','Team'])
q.head()

            Name            Team variable value
0  Avery Bradley  Boston Celtics   Number     0
1    Jae Crowder  Boston Celtics   Number    99
2   John Holland  Boston Celtics   Number    30
3    R.J. Hunter  Boston Celtics   Number    28
4  Jonas Jerebko  Boston Celtics   Number     8

In [63]:
input_df = [{'name':'Sujeet', 'age':10},
            {'name':'Sameer', 'age':11},
            {'name':'Sumit', 'age':12}]
df = pd.DataFrame(input_df)
df

     name  age
0  Sujeet   10
1  Sameer   11
2   Sumit   12

In [72]:
for index,row in df.iterrows():
    print(row['name'],row['age'])

Sujeet 10
Sameer 11
Sumit 12

In [75]:
for ind in df.index:
    print(df.name[ind])

Sujeet
Sameer
Sumit

In [76]:
len(df)

3

In [79]:
for i in range(len(df)):
    print(df.loc[i,'age'])

10
11
12

In [81]:
df.iloc[0,0]
df.iloc[0,1]

10

In [84]:
for i in range(len(df)):
    print(df.iloc[i,0],df.iloc[i,1])

Sujeet 10
Sameer 11
Sumit 12

In [85]:
record = {
  
 'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
 'Age': [21, 19, 20, 18, 17, 21],
 'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
 'Percentage': [88, 92, 95, 70, 65, 78] }
df= pd.DataFrame(record)
df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [86]:
print(df[df.Percentage >80])

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95

In [87]:
print(df.loc[df.Percentage >80])

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95

In [88]:
print(df[df.Stream.isin(['Math','Science'])])

        Name  Age   Stream  Percentage
0      Ankit   21     Math          88
2  Aishwarya   20  Science          95
3   Priyanka   18     Math          70
4      Priya   17     Math          65
5    Shaurya   21  Science          78

In [91]:
print(df[(df.Stream.isin(['Science'])) & (df.Percentage>80)])

        Name  Age   Stream  Percentage
2  Aishwarya   20  Science          95

In [92]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/11'], 
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'], 
                    'Cost':[10000, 5000, 15000, 2000]}) 
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3    13/2/11   Comedy   2000

In [98]:
df.shape

(4, 3)

In [100]:
rowlist = []
for i in range(df.shape[0]):
    rowlist.append(list(df.loc[i,:]))
print(rowlist)

[['10/2/2011', 'Music', 10000], ['11/2/2011', 'Poetry', 5000], ['12/2/2011', 'Theatre', 15000], ['13/2/11', 'Comedy', 2000]]

In [101]:
df.loc[1:3,['Event','Cost']]

     Event   Cost
1   Poetry   5000
2  Theatre  15000
3   Comedy   2000